<?PHP

// $array = [
//     [‛’‛名前’‛住所’‛電話’‛趣味’],
//     [‛1’‛上杉’‛愛媛県’‛089-123-2485’‛ボードゲーム’],
//     [‛２’‛佐藤’‛香川県’‛089-929-9889’‛釣り’],
//     [‛３’‛山下’‛徳島県’‛089-959-9599’‛釣り’],
//     [‛４’‛井上’‛高知県’‛089-558-9599’‛お酒’]
// ];



$table = array(
    array(
        "" => "1",
        "名前" => "上杉",
        "住所" => "愛媛県",
        "電話" => "089-123-2485",
        "趣味" => "ボードゲーム"
    ),
    array(
        "" => "2",
        "名前" => "佐藤",
        "住所" => "香川県",
        "電話" => "089-929-9889",
        "趣味" => "釣り"
    ),
    array(
        "" => "3",
        "名前" => "山下",
        "住所" => "徳島県",
        "電話" => "089-959-9599",
        "趣味" => "釣り"
    ),
    array(
        "" => "4",
        "名前" => "井上",
        "住所" => "高知県",
        "電話" => "089-558-9599",
        "趣味" => "お酒"
    )
);
?>
<html>
<head>
<meta http-equiv="Content-Type" content="text/html;charset=UTF-8" />
<title></title>
</head>
<body>

<table border=1>
    <?php foreach($table as $row){ ?>
    <tr>
        <?php foreach($row as $cel){ ?>
            <td><?= $cel?></td>
        <?php } ?>
    </tr>
    <?php } ?>
</table>

</body>
</html>
